Autodesk.Revit.DB.ImageView.Create(Autodesk.Revit.DB.Document,System.String)
Create an ImageView containing an image imported from disk.
document:
The document in which to create the view.
imageFileName:
The full path to the image file.
Returns:
The newly created view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given imageFileName does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ImageView.ImageInstanceId
Id of the image in the view.

Autodesk.Revit.DB.ImageView
Class for ImageView views